package com.wowo.ffms.constant;

/**
 * 版权：(C) 版权所有 2000-2019 上海天好电子商务股份有限公司苏州分公司
 * <简述>
 * <详细描述>
 *
 * @author lingjian
 * @version $
 * @see
 * @since
 */
public class SsStudentBaseInfoConstants {

    /**
     * @Fields BATCH_NUM : 每批插入的数据量
     */
    public static final int BATCH_NUM = 1000;

    /**
     * @Fields STU_IMPORT_EXCEL_HEAD : 学生信息导入模板表头
     */
    public static final String[] STU_IMPORT_EXCEL_HEAD = {"学段", "年级", "班号", "姓名", "性别", "有效证件类型", "有效证件号", "手机号", "邮箱", "学生学籍号"
            , "校内学号", "班内学号", "会考号", "教育Id号", "全国学籍号", "学籍辅号", "学生类别", "就读方式", "招生类别", "是否本市学籍", "受过学前教育"
            , "随班就读", "学生状态", "原学校名称", "学生来源", "入学方式", "入学日期", "学生来处", "姓名拼音", "英文名", "出生日期", "出生地", "国别"
            , "民族", "籍贯", "政治面貌", "健康状况", "残疾类型", "过敏史", "现住址", "居住地", "家庭住址", "通讯地址", "邮政编码", "户口性质", "户口所在地"
            , "户口所在地-详细地址", "是否按本市户口学生对待", "留守儿童", "进城务工子女", "港澳台侨外", "独生子女", "孤儿", "烈士优抚子女", "是否需要申请资助", "是否享受一补", "是否是军区子弟"};
}
